public class floydwarshall {
    	/*Index 별 장소 지정(column)
    	 * 0: IT대학
    	 * 1: 가천관
    	 * 2: 글로벌센터
    	 * 3: 비전타워(학식)
    	 * 4: 비전타워(식당가)
    	 * 5: 공과대학1
    	 * 6: 공과대학2
    	 * 7: 교육대학원(학식)
    	 * 8: 중앙도서관
    	 * 9: 전자정보도서관
    	 * 10: 예술대학1(학식)
    	 * 11: 예술대학2
    	 * 12: 바이오나노대학
    	 * 13: 바이오나노연구원
    	 * 14: 웅지관
    	 * 15: 학생회관
    	 * 16: 기숙사
    	 */
    int arr[][] = {{1,6,1,3,5,2,3,7,10,3,3,5,5,3,5,12,17},        
			{6,1,7,5,6,5,4,5,8,5,5,3,2,5,3,7,13},
			{1,7,1,4,6,2,7,7,10,4,3,5,5,5,7,12,17},
			{3,5,4,1,1,3,5,8,11,3,6,6,5,4,6,13,18},
			{5,6,6,1,1,4,3,8,11,3,8,6,5,2,4,15,20},
			{2,5,2,3,4,1,7,7,12,4,2,3,4,5,7,11,16},
			{3,4,7,5,3,7,1,8,11,4,8,7,5,2,3,12,17},
			{7,5,7,8,8,7,8,1,4,7,5,4,4,8,6,7,12},        				
			{10,8,10,11,11,12,11,4,1,10,8,7,7,10,8,5,10},
			{3,5,4,3,3,4,4,7,10,1,7,7,5,5,6,12,17},
			{5,3,5,6,6,3,7,4,7,7,2,1,1,7,5,11,16},
			{5,2,5,5,5,4,5,4,7,5,3,1,1,5,3,10,15},
			{3,5,5,4,2,5,2,8,10,5,7,7,5,1,5,14,19},
			{5,3,7,6,4,7,3,6,8,6,9,5,3,5,1,11,16},
			{12,7,12,13,15,11,12,7,5,12,10,11,10,14,11,1,6},
			{17,13,17,18,20,16,17,12,10,17,15,16,15,19,16,6,1}};
    
	floydwarshall() {
		for(int i= 0 ; i < arr.length ; i++){
			for(int j = 0 ; j < arr.length ; j++){
				for(int k = 0 ; k < arr.length ; k++){
						arr[i][j] = Math.min(arr[i][j], arr[i][k]+arr[k][j]);
				}
			}
		}
	}

	int distance(int start, int dest) {     
       // System.out.println(arr.length);       

  /*      for(int i=0; i<arr.length; i++) {
            for(int j=0; j<arr.length; j++) {
                System.out.print(arr[i][j]+ " ");
            }System.out.println();
        }	*/
		//System.out.println(arr[start][dest]);
		return arr[start][dest];
      

	
	}
}